// *++
//
// Copyright (c) 2005, Intel Corporation                                                         
// All rights reserved. This program and the accompanying materials                          
// are licensed and made available under the terms and conditions of the BSD License         
// which accompanies this distribution. The full text of the license may be found at         
// http://opensource.org/licenses/bsd-license.php                                            
//                                                                                           
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,                     
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.             
// 
// Module Name:
//
//   GuidStrings.uni
// 
// Abstract:
// 
//   String definitions for the Shell shellenv command
// 
// Revision History:
// 
// --*/ 

/=#

#langdef   eng "English"
#langdef   fra "Français"

#string STR_SHELLENV_PROTID_FOURTEEN_VARS #language eng  "  %h-.*s : %08x-%04x-%04x-%02x%02x-%02x%02x%02x%02x%02x%02x  %c\n"

#string STR_GUID_LINEHELP     #language eng  "Displays all the GUIDs in the EFI environment"

#string STR_GUID_VERBOSEHELP  #language eng  "Displays all the GUIDs that have been registered in the EFI environment.\n"
                                                      "\n" 
                                                      "GUID [-b]\n" 
                                                      "\n" 
                                                      "    -b     - Displays one screen at a time\n"
                                                      "\n" 
                                                      "Note:\n" 
                                                      "     1. Only displays the guids that were included in the core EFI build at\n"
                                                      "        the time the core was built. Additional guids may have been added by\n"
                                                      "        the BIOS integrator. Any GUIDs that are not in the original core build\n" 
                                                      "        or were added by a new protocol that was loaded by the user will show\n"
                                                      "        up as Unknown Device.\n" 
                                                      "     2. The guid with a '*' at end means that there will probably be dump\n"
                                                      "        information or token avalible for the protocol to this GUID. We can use\n" 
                                                      "        'dh' command to dump out those info.\n" 
                                                      "\n" 
                                                      "Examples:\n" 
                                                      "    fs0:\\> guid -b\n" 
                                                      "      DevIo            : AF6AC311-84C3-11D2-8E3C-00A0C969723B\n" 
                                                      "      diskio           : CE345171-BA0B-11D2-8E4F-00A0C969723B\n" 
                                                      "      blkio            : 964E5B21-6459-11D2-8E39-00A0C969723B  *\n" 
                                                      "      txtin            : 387477C1-69C7-11D2-8E39-00A0C969723B\n" 
                                                      "      txtout           : 387477C2-69C7-11D2-8E39-00A0C969723B  *\n" 
                                                      "      fs               : 964E5B22-6459-11D2-8E39-00A0C969723B\n" 
                                                      "      load             : 56EC3091-954C-11D2-8E3F-00A0C969723B\n" 
                                                      "      image            : 5B1B31A1-9562-11D2-8E3F-00A0C969723B  *\n" 
                                                      "      ...\n"
